name: "ner"
input: "data"
input_dim: 1
input_dim: 375
input_dim: 1
input_dim: 1
layers {
  name: "fc1"
  type: INNER_PRODUCT
  inner_product_param {
    num_output: 300
  }
  bottom: "data"
  top: "fc1"
}
layers {
  name: "htanh"
  type: HTANH
  bottom: "fc1"
  top: "htanh"
}
layers {
  name: "fc3"
  type: INNER_PRODUCT
  inner_product_param {
    num_output: 17
  }
  bottom: "htanh"
  top: "fc3"
}
